{
    "totalcredits": 24,
    "subcount": 6,
    "labcount": 2,
    "sub1": [
        {
            "code": "MAT 01",
            "title": "Engineering Mathematics - I",
            "credits": "4",
            "unit1": "Differential Equations: Linear differential equations of second and higher order with constant coefficients - particular integrals - homogeneous differential equations with variable coefficients - method of parameters - simulation equations.",
            "unit2": "Laplace Transforms I: Laplace transforms of standard functions - inverse transforms - transforms of derivatives and integrals - derivatives of transforms - integrals of transforms.",
            "unit3": "Laplace Transforms II: Transforms of periodic functions - convolution theorem - applications to solution of ordinary differential equations.",
            "unit4": "Calculus: Roll’s and Mean value theorems - Taylor’s and Maclaurins’s series - maxima and minima for functions of two variables - Infinite series - Convergence Tests series of positive terms - comparison, Ratio tests - Alternating series - Leibnitz’s rule - Absolute and conditional convergence.",
            "unit5": "Multiple Integrals: Curve tracing (both Cartesian and polar coordinate) - Evaluations of double and Triple integrals - change of order of integrations - change of variables of integrations - simple applications to areas and volumes.",
            "textbooks": "1. B S Grewal, Higher Engineering Mathematics, 40th Edition, Khanna Publications, 2007.\n2. M K Venkataraman, Engineering Mathematics, National Publishing Company, Chennai.\n3. B V Ramana, Higher Engineering Mathematics, 6th Reprint, Tata McGraw-Hill, 2008.\n4. Bali and Iyengar, Engineering Mathematics, 6th Edition, Laxmi Publications, 2006.",
            "refbooks": ""
        }
    ],
    "sub2": [
        {
            "code": "CST 01",
            "title": "Computer Programming",
            "credits": "4",
            "unit1": "Introduction to Programming – Problem Solving Steps, SDLC, Algorithms, and Flow charts.\n\nCommon features of C and C++ Programming Languages – Identifiers, Variables, Constants, Data types, Operators and Expressions, Input / Output operations.\n\nStatements - Decision Making, Branching and Looping, continue, go to and break.\n\nPrecedence and Associativity, Expression Evaluation, Type conversions.\n\nC and C++ Simple Programming examples",
            "unit2": "Arrays and Strings – Concepts, arrays, one and two and multidimensional arrays. Strings Handling: String Input / Output functions, arrays of strings, string manipulation functions, data conversion, C and C++ Simple Programming examples.\n\nDesigning Structured Programs - Functions - basics, functions, Scope, Storage classes - auto, register, static, extern, scope rules, type qualifiers, recursion, Preprocessor directives.\n\nDerived types – Structures – Declaration, definition and initialization of Structures, accessing structures, nested structures, arrays of structures, structures and functions, pointers to structures, self referential structures, unions, typedef, bit fields, enumerated types. C and C++ Simple Programming examples.",
            "unit3": "Pointers – Introduction, Pointers for inter function communication, pointers to pointers, compatibility, memory allocation functions, array of pointers, pointers to void, pointers to functions, command–line arguments. C and C++ Simple Programming examples.\n\nData File Handling: Input and Output – Concept of a file, streams, standard input / output functions, formatted input / output functions, text files and binary files, file input / output operations, file status functions (Eq.error handling). C and C++ Simple Programming examples.\n\nDynamic Memory Allocation: Allocating a Block and Multiple Blocks, releasing the used space and altering memory size. C and C++ Simple Programming examples.",
            "unit4": "Basics of Object Oriented Programming (OOP) and C++: Benefits of OOP, datatypes, declarations, expressions and operator precedence, scope of variables.\n\nIntroductionto OOP and Concepts: Abstraction, Data hiding, Encapsulation Classes and objects, Constructors & Destructors, Operator overloading & type conversions.\n\nPolymorphism: Pointers, virtual functions and polymorphism - pointers to objects, this pointer, pointers to derived classes, virtual and pure virtual function. C++ Simple Programming examples.",
            "unit5": "Inheritance: Derived classes, syntax of derived classes, making private members inheritable, single, multilevel, multiple, hierarchical, hybrid inheritance.\n\nTemplates, Exception handling, Console I/O and File I/O: class templates, Function templates, member function templates, exception handling, managing console I/O operations, working with files. Programming guide lines and Simple C++ Programming examples.",
            "textbooks": "1. Scheldt H, C: The Complete Reference, 4th Edition, Tata McGraw-Hill, 2002.\n2. Balagurusamy E, Programming in ANSI C, 4th Edition, Tata McGraw-Hill, 2008.\n3. Robert Lefore, Object Oriented Programming in C++, 4th edition, PEARSON Education.\n4. Scheldt H , C++ : The Complete Reference, Tata McGraw-Hill.",
            "refbooks": "1. C Programming with problem solving, J.A. Jones & K. Harrow, dreamtech Press.\n2. Programming in C – Stephen G. Kochan, III Edition, PearsonEductaion.\n3. C for Engineers and Scientists, H.Cheng, Mc.Graw-Hill International Edition.\n4. Data Structures using C – A.M.Tanenbaum, Y.Langsam, and M.J.Augenstein, Pearson Education / PHI.\n5. C Programming & Data Structures, P. Dey, M Ghosh R Thereja,Oxford University Press.\n6. C & Data structures – E V Prasad and N B Venkateswarlu, S.Chand& Co.\n7. Kernighan & Ritchie, The C programming language (2nd edition). Prentice Hall of India, 1988.\n8. Coohoon and Davidson, C++ Program Design: An introductionto Programming and Object-Oriented Design. Tata McGraw Hill3rd edition. 2003.\n9. G. Dromey, How to Solve it by Computer, Prentice-Hall Inc.,Upper Saddle River, NJ, 1982.Yashwant Kanetkar, Let's C, Allied Publishers, 1998.\n10. Programming in C, PradipDey, ManasGhosh, Second Edition, OXFORD."
        }
    ],
    "sub3": [
        {
            "code": "CET 01",
            "title": "Environmental Studies",
            "credits": "3",
            "unit1": "Environmental Studies and Natural Resources: Definition, Scope and importance of Environment, Environmental studies, Need for public awareness.\nComponents of Environment - Atmosphere, Hydrosphere, Lithosphere.\nRenewable and Non Renewable Resources and associated problems:\n• Water resources: Use and over utilization of surface and ground water, floods, drought, conflicts over water, dams benefits and problems.\n• Forest resources: Use and over exploitation, deforestation, case studies. Timber extraction, mining, dams and their effects on forests and tribal people.\n• Land resources: Land as a resource, land degradation, Man induced landslides, soil erosion and desertification.\n• Mineral resources: Use and overexploitation, Environmental effects of extracting and using mineral resources, case studies.\n• Food resources: World food problems, changes caused agriculture and overgrazing, effects of modern agriculture, fertilizer – pesticide problems, water logging, salinity, Case studies.\n• Energy resources: Growing energy needs, renewable and non renewable energy sources, use of alternate energy sources. Case studies.\n• Role of an individual in conservation of natural resources.",
            "unit2": "Ecosystem and Biodiversity:\nEcosystem - Concept of an ecosystem.\n• Structure and functions of an ecosystem.\n• Producers, consumers and decomposers.\n• Energy flow in the ecosystem.\n• Ecological succession.\n• Food chains, food webs and ecological pyramids.\n• Introduction, types, characteristic features, structure and function of the following ecosystem.\n(a) Forest ecosystem\n(b) Grassland ecosystem\n(c) Desert ecosystem\n(d) Aquatic ecosystem (ponds, streams, lakes, rivers, oceans, estuaries).\nBiodiversity and its conservation:\n• Definition, genetic species and ecosystem diversity.\n• Biogeographically classification of India.\n• Value of biodiversity: consumptive use, productive use, social, ethical, aesthetic and option values.\n• Biodiversity at global, National and local levels.\n• India as a mega-diversity nation.\n• Hot-spots of biodiversity.\n• Threats to biodiversity: habitat loss, poaching of wildlife, man – wildlife conflicts.\n• Conservation of biodiversity: in-situ and ex-situ conservation of biodiversity.",
            "unit3": "Environmental pollution and Global Effects:\n• Definition, Causes, Effects, and control measures of (a) Air pollution (b) Water pollution (c) Soil pollution (d) Marine pollution (e) Noise pollution (f) Thermal pollution (g) Nuclear hazards.\n• Solid waste Management: Causes, effects and control measures of urban and industrial wastes.\n• Role of an individual in prevention of pollution.\n• Pollution case studies.\n.• Disaster management: Floods, earthquakes, cyclone, landslides, Tsunami.\n• Climate change-Global warming, Acid rain, Ozone depletion.",
            "unit4": "Environment Issues and Management:\n• Environment and Human health – Epidemic diseases, HIV/AIDS, Aviation Flue, Water Borne Diseases.\n• Environmental Impact Assessment, Sustainable Development, Clean Production and Clean Development Mechanisms.\n• Environment Legislation: Environmental Protection Act, Water Act, Air Act, Wild Life Protection Act, Forest Conservation Act, Public Liability & Insurance Act, Issues involved in Enforcement of Environmental legislation.",
            "unit5": "Social Issues and the Environment:\n• Population growth, Population Explosion, Population Control, Women and Child welfare.\n• Urbanization, Industrialization, Development projects, Resettlement and Rehabilitation of people – Problems concerned, Case studies.\n• Consumerism and Waste Products Conservation, Public Awareness, Water Conservation, Rain water harvesting, watershed management, Wasteland reclamation, Human Rights, Value education, Environmental ethics - Issues and possible solution.\n• Role of information Technology in Environment and Human Health.",
            "textbooks": "1. Anubha Kaushik & C P Kaushik, Environmental studies, New age International Publishers, 2008.\n2. Benny Joseph, Environmental studies, Tata McGraw-Hill Publishers, 2005.\n3. M Chandra Sekhar, Environmental Science, Hi-Tech Publishers, 2004.\n4. Keerthinarayana and Daniel Yesudian, Principles of Environmental Sciences and Engineering , Hi-Tech Publishers, 2005.\n5. AmalK.Datta, Introduction to Environmental Science and Engineering, Oxford & IBH Publishing Co.Pvt.Ltd, 2000.\n6. SanthoshkumarGarg,RajeshawriGarg and RajniGarg, Ecological and Environmental studies, Khanna publishers, 2006.",
            "refbooks": "1. Gilbert M, Introduction to Environmental Engineering and Science, Masters Publication by Prentice –Hall of India Private Ltd., 1991.\n2. William P Cunningham and Mary Ann Cunningham, Principles of Environmental Science, Tata McGraw Hill Publishing Co.Ltd, 2002."
        }
    ],
    "sub4": [
        {
            "code": "CET 02",
            "title": "Basic Civil Engineering",
            "credits": "3",
            "unit1": "CIVIL ENGINEERING MATERIALS: Introduction to materials – Timber, Cement, Steel, Bricks, Rocks & Stones, Tiles, Ceramics, Glass, Paints, Varnishes and Distempers.\nMixes: Mortars, Concrete.",
            "unit2": "ELEMENTS OF BUILDING CONSTRUCTION: Types of buildings, Functional requirements of a building, principles of planning of a building, brick masonry, floors and floorings, Doors and windows, stairs, roofs, types of foundation, failure of foundations and remedial measures.",
            "unit3": "SURVEYING: Objective of Surveying, Types of surveying, classification of surveying, principles of surveying, measurement of distance, measurement of distance, measurement of angles, leveling, determination of Areas and volumes.\nBasic principles and applications of remote sensing, Global positioning systems (GPS), Geographical Information System (GIS).",
            "unit4": "TRANSPORTATION ENGINEERING: Roads: Introduction, Road transport characteristics, Benefit of a good system of roads, classification of roads.\nBridges: Necessity of bridges, site investigation, components of a bridge, classification of bridges.",
            "unit5": "WATER RESOURCES & ENVIRONMENTAL ENGINNEING: Water resources - quality and quantity, water quality standards for drinking and construction - Irrigation and types – crop seasons - Types of crops, reservoirs and types - rain water harvesting.",
            "textbooks": "1. ELEMENTS OF CIVIL ENGINEERING, Edition: 3rd Edition : 2015, AnuragA.Kandya.\n2. S.S. Bhavikatti , BASIC CIVIL ENGINEERING, Vikas Publishing House Pvt Limited, 2004.\n3. Palanichamy M S, Basic Civil Engineering, 3rd Edition, Tata McGraw-Hill, 2000.",
            "refbooks": "1. Gopi S, Basic Civil Engineering, Pearson Education, 2010."
        }
    ],
    "sub5": [
        {
            "code": "MET 02",
            "title": "Basic Mechanical Engineering",
            "credits": "3",
            "unit1": "Introduction to Thermodynamics – Concept of a system – Types of Systems, Thermodynamic Equilibrium – Properties, State, Process and Cycle, Zeroth Law, Energy Interactions – Heat and work, Types of work.\nFirst and Second Laws of Thermodynamics : First law, Cycle and process, Specific heats, Heat interactions in a closed system for various processes, Limitations of First law, Concept of Heat Engine (H.E.) and reversed heat engine (Heat pump and refrigerator), Efficiency/COP, Second Law: Kelvin – Plank and Clausius Statements , Carnot Cycle, Carnot Efficiency, Property of Entropy – T-S and P–V diagrams.",
            "unit2": "Thermal Power Plant: Thermal power plant layout – Four circuits – Rankine cycle, Boilers: Fire tube Vs Water Tube; BobCock and Wilcox, Cochran Boilers, Steam Turbines, Impulse Vs. Reaction Turbines, Compounding of Turbines.",
            "unit3": "Internal Combustion Engines (IC): I.C. 2–Stroke and 4–Stroke engines – S.I. engines and C.I. engines – Differences. Heat transfer – Modes – Thermal resistance concept, Conduction, Composite walls and Cylinders. Combined Conduction and Convection – Overall Heat transfer Coefficient, Simple Numerical Problems in Heat transfer.",
            "unit4": "Manufacturing Processes: Engineering Materials; Classification, Properties of materials, Metal Casting, Moulding, Patterns, Hot working and Cold working, Extrusion, Forging, Rolling and Drawing.\nMachine Tools and Machining Processes – Lathe Machines and Lathe operations, Milling machines, Types – Milling operations, Shaper, Planer, Drilling and Grinding machines.\nWelding – Gas welding, Arc Welding, Soldering and Brazing.",
            "unit5": "Power Transmission – Transmission of Mechanical Power, Belt drives, Simple Numerical Problems, Gear Drives – Simple Numerical Problems.\nBasics of Automotive vehicle – Brakes – Types - Clutch and Differential.",
            "textbooks": "1. Mathur, M.L., Mehta F.S. and Tiwari R.P., Elements of Mechanical Engineering, Jain Brothers, New Delhi, 2011.\n2. Roy K.P. and HazraChowdary, S.K., Elements of Mechanical Engineering, Media Promoters and Publishers Pvt., Ltd, 2002.\n3. Rudramoorthy R., Thermal Engineering, Tata McGrawHill Book Company, New Delhi, 2003.\n4. HazraChowdary, S.K., and Bose, Workshop Technology , Vol. I and II, Media Promoters and Publishers Pvt. Ltd., 2002.",
            "refbooks": ""
        }
    ],
    "sub6": [
        {
            "code": "ENT 01",
            "title": "English",
            "credits": "3",
            "unit1": "Effective Communication: Role and Importance of Communication, Features of Human Communication, Process of Communication, Interpersonal Communication, Barriers, Types - Verbal, Non-Verbal.",
            "unit2": "Grammar: Articles, prepositions, tenses, reported speech, idioms and phrases.",
            "unit3": "Listening Skills: Process of Listening, Tips for Effective Listening.\nSpeaking Skills: Basics of Spoken English, English Sounds, Rhythm and Intonation, Telephonic Skills, Group Communication.\nReading Skills: Developing Reading Skills, Reading Strategies, Reading Comprehension.\nWriting Skills: Paragraph Writing, Essay Writing, E-writing, Job applications, Reports, Resume and Letter Writing.",
            "unit4": "Soft Skills: Tem Work Skills, Interview Skills, Problem-Solving Skills, Adoptability Skills, Presentation Skills and Group Discussions.",
            "unit5": "Stories from Delight and Wisdom (An Anthology of Short Stories):\n1. The Gift of Magi By O. Henry.\n2. The Diamond Necklace by Guy De Maupassant.\n3. My Brother, My Brother by Norah Burke.\n4. The Open Window by Saki.\n5. The Child by Premchand",
            "textbooks": "1. Oxford guide to Effective writing and Speaking by John Seely, Oxford University Press, 2013, ISBN- 978-0-19-871393-7.\n2. Delight and Wisdom published by Orient Blackswan, 2009, ISBN: 978-81-250-3716-3.",
            "refbooks": "1. David Green, Structure and Composition in English, Macmillan Publishers India Limted.\n2. Communicative English by E. Suresh Kumar, P. Sreehari, Orient BalckSwan, 2009, ISBN: 13:9788125032502.\n3. English and Soft Skills by S P Dhanavelpublished byOrient Blackswan, 2013, ISBN 9788125039808.\n4. Personality Development and Soft Skills by Barun K. Mitrapublished byOxford University Press, 2012, ISBN : 13:97280198066217."
        }
    ],
    "lab1": [
        {
            "code": "CSP 01",
            "title": "Computer Programming Lab",
            "credits": "2",
            "todo": "Week-1:\n\n1) Write a C program to make the following exchange between the variables a -> b -> c -> d -> a\n2) Write a C program to carry out the arithmetic operations addition, subtraction, multiplication, and division between two variables.\n3) Write a C program for printing prime numbers between 1 and n.\n\nWeek-2:\n\n1) Write a C program to construct a multiplication table for a given number.\n2) Write a program to reverse the digit of a given integer.\n3) Write a C program to find the sum of individual digits of a positive integer.\n4) Write a C program to calculate the factorial of a given number.\n\nWeek-3:\n\n1) Fibonacci sequence is defined as follows: the first and second terms in the sequence are 0 and 1. Subsequent terms are found by adding the preceding two terms in the sequence. Write a C program to generate the first n terms of the sequence.\n2) Write a program to calculate tax, given the following conditions:\n a) If income is less than 1, 50,000 then no tax.\n b) If taxable income is in the range 1,50,001 – 300,000 then charge 10% tax.\n c) If taxable income is in the range 3,00,001 – 500,000 then charge 20% tax.\n d) If taxable income is above 5,00,001 then charge 30% tax.\n\nWeek-4:\n\n1) Write a program to print the calendar for a month given the first Week-day of the month.\nInput the first day of the month (Sun=0,Mon=1,Tue=2,Wed=3,.....) : 3\nTotal number of days in the month : 31\n2) Write a C program to find the roots of a quadratic equation.\n\nWeek-5:\n\n1) Write a program to print the Pascal triangle for a given number.\n2) Write a C program to find the GCD (greatest common divisor) of two given integers.\n3) Write a C program to construct a pyramid of numbers.\n4) Write C code to define a function cash_dispense, which takes an amount as its input, and returns the number of 1000, 500, 100, 50, 20, 10, 5, 2, 1 rupee denomination that make up the given amount.\n\nWeek-6:\n\n1) Write C code to reverse the contents of the array. For example, [1,2,3,4,5] should become [5,4,3,2,1].\n2) Write a C program that uses functions to perform the following:\n i) Addition of Two Matrices\n ii) Multiplication of Two Matrices\n3) Write a program that will search and find out the position where the given key element exist in a user chosen array and print it as output.\n\nWeek-7:\n\n1) Write C code to compute the frequency table of survey responses given by 20 users. The survey responses range from 1 to 5 and are stored in an array. For example, 10 responses are stored in the array [1,1,5,2,3,3,5,5,2,2]. The frequency table will be as shown below:\na. 1 = 2\nb. 2 = 3\nc. 3 = 2\nd. 4 = 0\ne. 5 = 3\n2) Write a program to define a function to sort an array of integers in ascending order by using exchange sort.\n\nWeek-8:\n\n1) Write a C program to check whether a given string is a palindrome or not, without using any built-in functions.\n2) Write a C program to determine if the given string is a palindrome or not by using string functions.\n3) Write a function that accepts a string and delete the first character.\n4) Write a function that accepts a string and delete all the leading spaces.\n\nWeek-9:\n\nWrite a program to accept a string from user and display number of vowels, consonants, digits and special characters present in each of the words of the given string.\n\nWeek-10:\n\n1) Write a C program to define a union and structure both having exactly the same numbers using the sizeof operators print the sizeof structure variables as well as union variable.\n2) Declare a structure time that has three fields hr, min, secs. Create two variables,start_timeandend_time. Input there values from the user. Then while start_time is not equal to end_time display GOOD DAY on screen.\n\nWeek-11:\n\n1) Write a program to read in an array of names and to sort them in alphabetical order. Use sort function that receives pointers to the functions strcmp, and swap, sort in turn should call these functions via the pointers.\n2) Write a program to read and display values of an integer array. Allocate space dynamically for the array using the malloc().\n3) Write a program to calculate area of a triangle using function that has the input parameters as pointers as sides of the triangle.\n\nWeek-12:\n\n1) Two text files are given with the names text1 and text2. These files have several lines of text. Write a program to merge (first line of text1 followed by first line of text2 and so on until both the files reach the end of the file) the lines of text1 and text2 and write the merged text to a new file text3.\n2) Write a program to split a given text file into n parts. Name each part as the name of the original file followed by .part<n> where n is the sequence number of the part file.",
            "refbooks": ""         
        }
    ],
    "lab2": [
        {
            "code": "ENP 01",
            "title": "English Communication Lab",
            "credits": "2",
            "todo": "At least twenty exercises covering the topics: Stress, Introduction, Accent, Intonation, English vs Hinglish and Important Skills using Computer-Aided Packages.",
            "refbooks": "1. Barry Tomalin and Suhashini Thomas, International English for Call Centres, McMillan Publishers, India Limited, 2009."
        }
    ]
}